/*
 *  Multi2Sim
 *  Copyright (C) 2014  Sida Gu(dudlykoo@gmail.com)
 *
 *  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; either version 2 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program; if not, write to the Free Software
 *  Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
 */

#include <cstring>
#include <errno.h>
#include <fcntl.h>
#include <poll.h>
#include <syscall.h>
#include <unistd.h>
#include <sys/mman.h>
#include <sys/stat.h>
#include <sys/uio.h>

#include <arch/common/Driver.h>
#include <arch/common/FileTable.h>
#include <arch/common/Runtime.h>
#include <lib/cpp/Misc.h>
#include <lib/cpp/String.h>

#include "Context.h"
#include "Emulator.h"
#include "Regs.h"


namespace MIPS
{
#define __UNIMPLEMENTED__ misc::fatal("%s: unimplemented system call.\n\n%s", \
		__FUNCTION__ + 15, syscall_error_note); return 0;

const char *Context::syscall_name[SyscallCodeCount + 1] =
{
#define DEFSYSCALL(name, code) #name,
#include "ContextSyscall.def"
#undef DEFSYSCALL

	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_rt_sigreturn()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_rt_sigaction()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_rt_sigprocmask()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_rt_sigpending()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_rt_sigtimedwait()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_rt_sigqueueinfo()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_rt_sigsuspend()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_pread64()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_pwrite64()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_chown()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_getcwd()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_capget()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_capset()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_sigaltstack()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_sendfile()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_getpmsg()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_putpmsg()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_mmap2()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_truncate64()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_ftruncate64()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}

// stat64 syscall implementation
struct sim_stat64_t
{
	unsigned long long dev;  /* 0 8 */
	unsigned int pad1;  /* 8 4 */
	unsigned int __ino;  /* 12 4 */
	unsigned int mode;  /* 16 4 */
	unsigned int nlink;  /* 20 4 */
	unsigned int uid;  /* 24 4 */
	unsigned int gid;  /* 28 4 */
	unsigned long long rdev;  /* 32 8 */
	unsigned int pad2;  /* 40 4 */
	long long size;  /* 44 8 */
	unsigned int blksize;  /* 52 4 */
	unsigned long long blocks;  /* 56 8 */
	unsigned int atime;  /* 64 4 */
	unsigned int atime_nsec;  /* 68 4 */
	unsigned int mtime;  /* 72 4 */
	unsigned int mtime_nsec;  /* 76 4 */
	unsigned int ctime;  /* 80 4 */
	unsigned int ctime_nsec;  /* 84 4 */
	unsigned long long ino;  /* 88 8 */
} __attribute__((packed));

int Context::ExecuteSyscall_stat64()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_lstat64()
{
	throw misc::Panic(misc::fmt("Unimplemented syscall (code %d)", regs.getGPR(2) - __NR_Linux));
}


int Context::ExecuteSyscall_fstat64()
{
	// Arguments
	int fd = regs.getGPR(4);
	unsigned int statbuf_ptr = regs.getGPR(5);

	struct stat statbuf;
	struct sim_stat64_t sim_statbuf;

	emulator->syscall_debug << misc::fmt("  fd=%d, statbuf_ptr=0x%x\n",
			fd, statbuf_ptr);

	// Get host descripptor
	int host_fd = file_table->getHostIndex(fd);
	emulator->syscall_debug << misc::fmt("  host_fd=%d\n", host_fd);

	// Host call
	int err = fstat(host_fd, &statbuf);
	if (err == -1)
	{
		// set reg a3 to 1 to indicate syscall failure
		regs.setGPR(7,1);
		return -errno;
	}

	if (sizeof(struct sim_stat64_t) != 96)
